import { HistoricalEventsArray } from "./types";

export const historicalEventsData: Array<HistoricalEventsArray> = [
  [
    {
      "category": "Изобретение",
      "date": 1886,
      "description": "Изобретение бензинового автомобиля, Германия (КарлБенц)"
    },
    {
      "category": "Космос",
      "date": 1957,
      "description": "Запуск первого искусственного спутника Земли 'Спутник-1', СССР"
    },
    {
      "category": "Наука",
      "date": 1928,
      "description": "Открытие пенициллина, Шотландия (Александр Флеминг)"
    },
    {
      "category": "Музыка",
      "date": 1964,
      "description": "Приезд группы 'The Beatles' в США"
    },
    {
      "category": "Кино",
      "date": 1975,
      "description": "Выход фильма 'Челюсти', США (реж. Стивен Спилберг)"
    },
    {
      "category": "Спорт",
      "date": 1980,
      "description": "Летние Олимпийские игры в Москве, СССР"
    }
  ],
  [
    {
      "category": "Литература",
      "date": 1775,
      "description": "Выход первого издания «Поэтического сборника», Англия (Филлис Уитли)"
    },
    {
      "category": "Живопись",
      "date": 1830,
      "description":"Написание картины 'Свобода, ведущая народ', Франция (Эжен Делакруа)"
    },
    {
      "category": "Технологии",
       "date": 1879,
      "description":"Изобретение электрической лампочки, США (Томас Эдисон)"
    },
    {
      "category": "Космос",
      "date": 1969,
      "description": "Первая высадка человека на Луну, США (Аполлон-11)"
    },
    {
      "category": "Политика",
      "date": 1789,
      "description": "Начало Великой французской революции"
    },
    {
      "category": "Спорт",
      "date": 1896,
      "description": "Проведение первых современных Олимпийских игр в Афинах, Греция"
    }
  ],
  [
    {
      "category": "Кино",
      "date": 1927,
      "description": "Выход первого звукового фильма 'Певец джаза', США"
    },
    {
      "category": "Музыка",
      "date": 1954,
      "description":"Появление рок-н-ролла, США"
    },
    {
      "category": "Технологии",
      "date": 1975,
      "description": "Появление персонального компьютера 'Altair 8800', США"
    },
    {
      "category": "Наука",
      "date": 1983,
      "description":"Открытие вируса иммунодефицита человека (ВИЧ), Франция"
    },
    {
      "category": "Изобретение",
      "date": 1837,
      "description": "Изобретение телеграфа, США (Сэмюэл Морзе)"
    },
    {
      "category":"Литература",
      "date": 1848,
      "description":"Выход романа 'Грозовой перевал', Англия (Эмили Бронте)"
    }
  ],
  [
    {
      "category": "Живопись",
      "date": 1907,
      "description":"Написание картины 'Авиньонские девицы', Франция (Пабло Пикассо)"
    },
    {
      "category": "Искусство",
      "date": 1917,
      "description": "Выход первого джазового альбома 'Livery Stable Blues', США"
    },
    {
      "category": "Спорт",
      "date": 1936,
      "description":"Проведение Олимпийских игр в Берлине, Германия"
    },
    {
      "category": "Наука",
      "date": 1953,
      "description":"Открытие структуры ДНК, Великобритания"
    },
    {
      "category": "Политика",
      "date": 1963,
      "description": "Марш на Вашингтон за гражданские права, США"
    },
    {
      "category": "Космос",
      "date": 1971,
      "description":"Запуск первой космической станции 'Салют-1', СССР"
    }
  ],
  [
    {
      "category":"Литература",
      "date": 1986,
      "description":"Выход романа 'Оно', США (Стивен Кинг)"
    },
    {
      "category":"Технологии",
      "date": 1989,
      "description":"Появление всемирной паутины (World Wide Web), Швейцария (Тим Бернерс-Ли)"
    },
    {
      "category": "Музыка",
      "date": 1991,
      "description":"Выход альбома 'Nevermind', США (Nirvana)"
    },
    {
      "category":"Кино",
      "date": 1994,
      "description":"Выход фильма 'Форрест Гамп', США (реж. Роберт Земекис)"
    },
    {
      "category":"Изобретение",
      "date": 1995,
      "description": "Появление первого DVD-проигрывателя, Япония"
    },
    {
      "category":"Спорт",
      "date": 1996,
      "description":"Проведение летних Олимпийских игр в Атланте, США"
    }
  ],
  [
    {
      "category":"Политика",
      "date": 1999,
      "description": "Введение евро как единой европейской валюты"
    },
    {
      "category": "Наука",
      "date": 2003,
      "description":"Расшифровка человеческого генома, международный проект"
    },
    {
      "category":"Технологии",
      "date": 2007,
      "description":"Выпуск первого iPhone, США (Apple)"
    },
    {
      "category":"Музыка",
      "date": 2011,
      "description":"Выход альбома '21', Великобритания (Adele)"
    },
    {
      "category": "Кино",
      "date": 2019,
      "description": "Выход фильма 'Мстители: Финал', США (реж. Энтони и Джо Руссо)"
    },
    {
      "category": "Космос",
      "date": 2021,
      "description":"Успешная посадка марсохода 'Perseverance', США (NASA)"
    }
  ]
];